tests/fixtures/repayments.json

[
    {
        "currency": "usdt",
        "amount": "5.0",
        "principal": "0.0",
        "interest": "5.0",
        "state": "confirmed",
        "sn": "1234567890",
        "created_at": 1681281539000
    },
    {
        "currency": "usdt",
        "amount": "10.0",
        "principal": "0.0",
        "interest": "10.0",
        "state": "confirmed",
        "sn": "1234567890",
        "created_at": 1681281497000
    },
    {
        "currency": "usdt",
        "amount": "10.0",
        "principal": "0.0",
        "interest": "10.0",
        "state": "confirmed",
        "sn": "1234567890",
        "created_at": 1654828905000
    },
    {
        "currency": "usdt",
        "amount": "0.05482213",
        "principal": "0.0",
        "interest": "0.05482213",
        "state": "confirmed",
        "sn": "1234567890",
        "created_at": 1648028806000
    },
    {
        "currency": "usdt",
        "amount": "0.10000012",
        "principal": "0.0",
        "interest": "0.10000012",
        "state": "confirmed",
        "sn": "1234567890",
        "created_at": 1638523699000
    }
]